app/controllers/posts_controller.rb

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
---
  def new
    if params[:author_id] && Author.find_by_id(params[:author_id]).nil?